import swal from 'sweetalert'; // добавить в КАЖДЫЙ файл где используется уведомление

// добавить при рендере главной страницы
// const mainTitle = "Привет пользователь!";
// const mainMessage = "Рады приветствовать тебя на нашей страничке! Она предназначена, чтобы облегчить тебе поиск фильмов для просмотра Жми «ОК» и воспользуйся поиском или выбери фильм из списка 'Популярное за неделю'. Также можешь отсортировать фильмы по жанрам. При клике на постер фильма откроется окно с подробной информацией о фильме. Ты можешь добавить фильм в список 'Уже смотрел!' или 'Хочу смотреть!'. Приятного пользования! С любовью студенты GoIT группы CIV-team!";
// swal(mainTitle, mainMessage,);

// добавить в функцию при клике на "MY LIBRARY"
// const libraryMessage = "Это 'Твоя библиотека' Тут будут хранится фильмы, которые ты добавил(ла) в списки. По умолчанию список 'Уже смотрел(ла)'. При клике на 'QUEUE' переходишь в список 'Хочу смотреть'. Развлекайся!";
// swal(libraryMessage); 

// добавить в проверку на пустой список WATCHED
// swal("Ей, так не годится", "Дружище, посмотри уже на конец что-нибудь", "warning");

// добавить в проверку на пустой список QUEUE
// swal("Ей, так не годится", "Дружище, выбери уже на конец что-нибудь", "warning");

// добавить, когда фильмы не найдены (404)
// swal("Поиск не удался", "Введи правильное название фильма и попробуй еще раз", "error", {button: false, timer: 3000,}); 

// добавить, когда пришел массив с фильмами после поиска (в finnally)
// const inputValue = "Введенное значение";
// swal("Есть", `Вот результаты поиска по запросу ${inputValue}`, "success", {button: false, timer: 3000,});

// добавить при клике на "ADD TO WATCHED"
// swal("Добавлено в просмотренные", "Но, если фильм понравился, то можно посмотреть еще раз", "success" {button: false, timer: 3000,});

// добавить при клике на "ADD TO QUEUE"
// swal("Добавлено в очередь", "Не забудь потом глянуть как нибудь", "success", {button: false, timer: 3000,});

// добавить при клике на "DELETE IN WATCHED"
// swal("Удалено из просмотренных", " ", "success", {button: false, timer: 3000,});

// добавить при клике на "DELETE IN QUEUE"
// swal("Удалено из очереди", "Уже посмотрел(ла)? Красавчик(ица)", "success", {button: false, timer: 3000,});

